spec/fixtures/files/puma_7501.xml

<?xml version="1.0" encoding="utf-8"?>
<CUSTOMS_ENTRY_FILE>
  <ENTRY>
    <FILER_CODE>316</FILER_CODE>
    <ENTRY_NO>5059096</ENTRY_NO>
    <CHECK_DIGIT>6</CHECK_DIGIT>
    <ENTRY_TYPE>06</ENTRY_TYPE>
    <!-- IF ExitDocType = 1, then "06", else "01" -->
    <VESSEL_NAME>FTZ2020H02</VESSEL_NAME>
    <IMPORT_DATE>03/12/2020</IMPORT_DATE>
    <US_ENTRY_PORT>2704</US_ENTRY_PORT>
    <TEAM_NO></TEAM_NO>
    <ENTRY_DATE>03/12/2020</ENTRY_DATE>
    <SUMMARY_DATE></SUMMARY_DATE>
    <MODE_OF_TRANSPORTATION></MODE_OF_TRANSPORTATION>
    <STATEMENT_DATE>03/19/2020</STATEMENT_DATE>
    <!-- NAFTA_RECON></NAFTA_RECON -->
    <!-- RECON_ISSUE></RECON_ISSUE -->
    <ULTIMATE_DESTINATION_STATE>MA</ULTIMATE_DESTINATION_STATE>
    <ESTIMATED_ARRIVAL_DATE></ESTIMATED_ARRIVAL_DATE>
    <APPLICATION_BEGIN_DATE></APPLICATION_BEGIN_DATE>
    <APPLICATION_END_DATE></APPLICATION_END_DATE>
    <NAFTA_DEFERRED>F</NAFTA_DEFERRED>
    <FIRMS_CODE>WAX9</FIRMS_CODE>
    <LIVE_ENTRY_FLAG>F</LIVE_ENTRY_FLAG>
    <!-- I ASSUME LIVE_ENTRY IS SET TO THE PROPER VALUE -->
    <ACH>F</ACH>
    <PAPERLESS_FLAG>T</PAPERLESS_FLAG>
    <PRORATE_WEIGHT>F</PRORATE_WEIGHT>
    <TOTAL_ENTERED_VALUE>963391</TOTAL_ENTERED_VALUE>
    <!-- MERCHANDISE_DESCRIPTION_3461 POSITION="1" LENGTH="40"></MERCHANDISE_DESCRIPTION_3461 -->
    <SURCHARGE_FLAG>F</SURCHARGE_FLAG>
    <GOVERNMENT_CONTRACT_FLAG>F</GOVERNMENT_CONTRACT_FLAG>
    <GROSS_WGT>20582</GROSS_WGT>
    <FREIGHT_CHARGES_ADVANCED>12524.08</FREIGHT_CHARGES_ADVANCED>
    <FREIGHT_CHARGES_NOT_ADVANCED>0.00</FREIGHT_CHARGES_NOT_ADVANCED>
    <NAFTA_COUNTRY></NAFTA_COUNTRY>
    <NAFTA_ARRIVAL_DATE></NAFTA_ARRIVAL_DATE>
    <!-- IMPORTER_OF_RECORD_DECLARATION></IMPORTER_OF_RECORD_DECLARATION -->
    <!-- PURCHASE_AGREEMENT_DECLARATION></PURCHASE_AGREEMENT_DECLARATION -->
    <CREATED_DATE_TIME>03/19/2020 12:18:06 PM</CREATED_DATE_TIME>
    <CALCULATE_DUTY_FEES>T</CALCULATE_DUTY_FEES>
    <HEADER_ADDRESS>
      <TYPE>IM</TYPE>
      <MID_OR_IRS_NO>95-322237000</MID_OR_IRS_NO>
      <NAME>COBRA PUMA GOLF</NAME>
      <LINE_1>1818 ASTON AVENUE</LINE_1>
      <CITY>CARLSBAD</CITY>
      <SUB_COUNTRY>CA</SUB_COUNTRY>
      <COUNTRY>US</COUNTRY>
      <POSTAL_CODE>92008</POSTAL_CODE>
      <PHONE_1>978-698-1096</PHONE_1>
      <BOND_TYPE>CONTINUOUS</BOND_TYPE>
      <SURETY_CODE>16C</SURETY_CODE>
    </HEADER_ADDRESS>
    <HEADER_DUTY_FEE>
      <DUTY_AMOUNT>164532.70</DUTY_AMOUNT>
      <MPF_AMOUNT></MPF_AMOUNT>
      <TOTAL_VALUE>963391.00</TOTAL_VALUE>
      <COTTON_FEE_AMOUNT>10.90</COTTON_FEE_AMOUNT>
      <!-- TOTAL_FEE_AMOUNT></TOTAL_FEE_AMOUNT -->
      <!-- TOTAL_AMOUNT_DUE></TOTAL_AMOUNT_DUE -->
    </HEADER_DUTY_FEE>
    <INVOICE>
      <CURRENCY_CODE>USD</CURRENCY_CODE>
      <FOREIGN_GROSS_INVOICE_AMOUNT>963391.00</FOREIGN_GROSS_INVOICE_AMOUNT>
      <ITEM>
        <ITEM_NO>001</ITEM_NO>
        <SUB_ITEM_INDICATOR>*</SUB_ITEM_INDICATOR>
        <DETAIL_INDICATOR>S</DETAIL_INDICATOR>
        <RECORD_STATE>R</RECORD_STATE>
        <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
        <SUB_COUNTRY_OF_ORIGIN></SUB_COUNTRY_OF_ORIGIN>
        <RELATED_FLAG>F</RELATED_FLAG>
        <MANUFACTURERS_ID_NO>CNGOLENTDON</MANUFACTURERS_ID_NO>
        <HTS>4202920807</HTS>
        <!-- PARSE, NO DECIMALS IN HTSNUM -->
        <HTS_VALUE>11.00</HTS_VALUE>
        <SPECIAL_PROGRAMS_INDICATOR_1></SPECIAL_PROGRAMS_INDICATOR_1>
        <SPECIAL_PROGRAMS_INDICATOR_2></SPECIAL_PROGRAMS_INDICATOR_2>
        <HTS_DESCRIPTION_1>INSUL FOOD/BEV BAG,MAN MD</HTS_DESCRIPTION_1>
        <HTS_DESCRIPTION_2></HTS_DESCRIPTION_2>
        <NET_ENTERED_VALUE>11</NET_ENTERED_VALUE>
        <ADDITIONAL_HTS>99038803</ADDITIONAL_HTS>
        <!-- PARSE, NO DECIMALS IN HTSNUM -->
        <ADDITIONAL_HTS_VALUE>0.00</ADDITIONAL_HTS_VALUE>
        <CHARGES>0</CHARGES>
        <GROSS_WGT>1</GROSS_WGT>
        <QTY_1>2</QTY_1>
        <QTY_2>1</QTY_2>
        <QTY_1_UOM>NO</QTY_1_UOM>
        <QTY_2_UOM>KG</QTY_2_UOM>
        <CURRENCY_CODE>USD</CURRENCY_CODE>
        <FTZ_STATUS>P</FTZ_STATUS>
        <FTZ_DATE>11/21/2019</FTZ_DATE>
        <FTZ_MANIFEST_QTY>2</FTZ_MANIFEST_QTY>
        <!--

		<FWS_REQUIRED>F</FWS_REQUIRED>
        <ITEM_DUTY_FEE>
          <MPF_AMOUNT >0.04</MPF_AMOUNT>
          <DUTY_AMOUNT >3.52</DUTY_AMOUNT>
        </ITEM_DUTY_FEE>

	-->
        <FCC_REQUIRED></FCC_REQUIRED>
        <FDA_REQUIRED></FDA_REQUIRED>
        <DOT_REQUIRED></DOT_REQUIRED>
      </ITEM>
    </INVOICE>
  </ENTRY>
</CUSTOMS_ENTRY_FILE>